9front-faces.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-06-20 Thu 23:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>faces</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">faces</h1>
<p>
a face is kind of like a profile picture
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0000000">1. format/tree</a>
<ul>
<li><a href="#org0000001">1.1. machinelist</a></li>
<li><a href="#org0000002">1.2. 48x48x&lt;B&gt;</a>
<ul>
<li><a href="#org0000003">1.2.1. dict</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0000004">2. creating a face</a>
<ul>
<li><a href="#org0000005">2.1. mug(1)</a></li>
<li><a href="#org0000006">2.2. iconv + resample</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org0000000" class="outline-2">
<h2 id="org0000000"><span class="section-number-2">1.</span> format/tree</h2>
<div class="outline-text-2" id="text-1">
<p>
faces are in the plan9 image format and live in <code>/lib/face</code> or
<code>$home/lib/face</code>. in this, we'll refer to either of them as
<code>lib/face</code>.
</p>
</div>

<div id="outline-container-org0000001" class="outline-3">
<h3 id="org0000001"><span class="section-number-3">1.1.</span> machinelist</h3>
<div class="outline-text-3" id="text-1-1">
<p>
the <code>lib/face/.machinelist</code> file contains aliases of hostnames in a
space-delineated format.
</p>

<pre class="example" id="org0000007">
meow.example.com meow
</pre>

<p>
would make face lookups for <code>meow.example.com</code> go to <code>meow</code>
</p>
</div>
</div>

<div id="outline-container-org0000002" class="outline-3">
<h3 id="org0000002"><span class="section-number-3">1.2.</span> 48x48x&lt;B&gt;</h3>
<div class="outline-text-3" id="text-1-2">
<p>
in <code>lib/face/48x48x&lt;B&gt;</code>, with <code>&lt;B&gt;</code> replaced with the number of
bits-per-pixel, is where actual face files live.
</p>

<p>
there is a convention of putting faces in directories based on the
first letter (ie <code>g/glenda.1</code> or <code>x/xenia.1</code>), however as far as i
know, this is not actually required by anything.
</p>
</div>

<div id="outline-container-org0000003" class="outline-4">
<h4 id="org0000003"><span class="section-number-4">1.2.1.</span> dict</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
serving as a machine-readable index for the faces, the
<code>lib/face/48x48x&lt;B&gt;/.dict</code> file contains domains names and relative
paths for faces.
</p>

<p>
for example, if <code>lib/face/48x48x8/.dict</code> contained 
</p>
<pre class="example" id="org0000007">
meow/xenia x/xenia.1
</pre>
<p>
then looking up the face for <code>xenia@meow</code> (or <code>xenia@meow.example.com</code>
if you had the aforementioned machinelist entry), it would look for a
face at <code>lib/face/48x48x8/x/xenia.1</code>.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org0000004" class="outline-2">
<h2 id="org0000004"><span class="section-number-2">2.</span> creating a face</h2>
<div class="outline-text-2" id="text-2">
<p>
largely based on <a href="http://9p.io/wiki/plan9/adding_your_face/index.html">9p wiki's create a face page</a>.
</p>
</div>

<div id="outline-container-org0000005" class="outline-3">
<h3 id="org0000005"><span class="section-number-3">2.1.</span> mug(1)</h3>
<div class="outline-text-3" id="text-2-1">
<p>
mug is a tool for cropping pictures into grayscale face files
</p>
</div>
</div>

<div id="outline-container-org0000006" class="outline-3">
<h3 id="org0000006"><span class="section-number-3">2.2.</span> iconv + resample</h3>
<div class="outline-text-3" id="text-2-2">
<pre class="example" id="org0000007">
png -c my-cool-icon.png |
iconv -c m8 |
resample -x 48 -y 48 &gt; cool.1
</pre>

<p>
the <code>m8</code> is the channel format. <code>m</code> means color-mapped, and <code>8</code> is the
number of bits-per-pixel. instead of <code>m</code>, you can use <code>k</code> for
grayscale, <code>r</code> <code>g</code> <code>b</code> for red green or blue, and <code>x</code> for it to pick
for you.  
</p>
</div>
</div>
</div>
</div>
</body>
</html>
